In [4]:
import pandas as pd

In [35]:
dept_frame = pd.read_csv('Data/departments.csv')
dept_emp = pd.read_csv('Data/dept_emp.csv')
dept_manager = pd.read_csv('Data/dept_manager.csv')
employees = pd.read_csv('Data/employees.csv')
salaries = pd.read_csv('Data/salaries.csv')
titles = pd.read_csv('Data/titles.csv')

In [37]:
'departments'
dept_frame.head(3)
'department emplyees'
dept_emp.head(3)
'department managers'
dept_manager.head(3)
'employees'
employees.head(3)
'salaries'
salaries.head(3)
'titles'
titles.head(3)

'departments'

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources

'department emplyees'

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01

'department managers'

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17

'employees'

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

'salaries'

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02

'titles'

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01